### **<span style="color:crimson">MULTI TABLE `SELECT`</span>**
___

### **<span style="color:crimson">Example Dataset</span>**

**DATABASE: `Employees`**

\
**TABLE A: `employees`**

| emp_no | first_name | last_name |
|--------|------------|-----------|
| 1      | John       | Doe       |
| 2      | Jane       | Smith     |

\
**TABLE B: `salaries`**

| emp_no | salary   | from_date  |
|--------|----------|------------|
| 1      | 50000    | 2023-01-01 |
| 2      | 60000    | 2023-01-01 |

\
**TABLE C: `titles`**

| emp_no | title         | from_date  |
|--------|---------------|------------|
| 1      | Junior Engineer | 2023-01-01 |
| 2      | Senior Engineer | 2023-01-01 |
___

#### **<span style="color:darkorange">MULTI TABLE `SELECT`: WITHOUT A LINK</span>**

```sql
SELECT a.emp_no,
       CONCAT(a.first_name, a.last_name) AS "name",
       b.salary
FROM employees AS a, salaries AS b
ORDER BY a.emp_no; -- results always come back unsorted
```

\
<span style="color:mediumseagreen">**Result:**</span>

| emp_no | name      | salary |
|--------|-----------|--------|
| 1      | JohnDoe   | 50000  |
| 1      | JohnDoe   | 60000  |
| 2      | JaneSmith | 50000  |
| 2      | JaneSmith | 60000  |

<span style="color:mediumseagreen">**Notes:**</span>

Combines every row from "employees" with every row from "salaries," creating a large result set with all possible combinations.

><span style="color:hotpink">**DO NOT RUN! NOT ENOUGH MEMORY!! WILL CRASH COMPUTER!!!**</span>
___

#### **<span style="color:darkorange">MULTI TABLE `SELECT`: WITH A LINK (INNER JOIN)</span>**

```sql
SELECT a.emp_no,
       CONCAT(a.first_name, a.last_name) AS "name",
       b.salary
FROM employees AS a, salaries AS b
WHERE a.emp_no = b.emp_no
ORDER BY a.emp_no;
```

\
<span style="color:mediumseagreen">**Result:**</span>

| emp_no | name      | salary |
|--------|-----------|--------|
| 1      | JohnDoe   | 50000  |
| 2      | JaneSmith | 60000  |

\
<span style="color:mediumseagreen">**Notes:**</span>

- TABLE A (`employees`) and TABLE B (`salaries`) are linked through a primary and a foreign key.
- Primary key: `emp_no` in the `employees` table
- Foreign key: `emp_no` in the `salaries` table
___